#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "ru");

    int d[6][6] =
    { {0, 28, 21, 59, 12, 27},
     {7, 0, 24, 1000, 21, 9},
     {9, 32, 0, 13, 11, 1000},
     {8, 1000, 5, 0, 16, 1000},
     {14, 13, 15, 10, 0, 22},
     {15, 18, 1000, 1000, 6, 0} };

    int s[6][6] =
    { {0, 2, 3, 4, 5, 6},
     {1, 0, 3, 4, 5, 6},
     {1, 2, 0, 4, 5, 6},
     {1, 2, 3, 0, 5, 6},
     {1, 2, 3, 4, 0, 6},
     {1, 2, 3, 4, 5, 0} };

    cout << "Матрица кратчайших путей между вершинами без промежуточных вершин: \n";
    for (int i = 0; i < 6; i++)
    {
        for (int j = 0; j < 6; j++)
        {
            cout << d[i][j] << " ";
        }
        cout << "\n";
    }

    cout << "\nМатрица последовательности вершин: \n";
    for (int i = 0; i < 6; i++)
    {
        for (int j = 0; j < 6; j++)
        {
            cout << s[i][j] << " ";
        }
        cout << "\n";
    }


    // алгоритм Флойда-Уоршелла
    for (int m = 0; m < 6; ++m)
    {
        for (int i = 0; i < 6; ++i)
        {
            for (int j = 0; j < 6; ++j)
            {
                if (d[i][j] > d[i][m] + d[m][j])
                {
                    d[i][j] = d[i][m] + d[m][j];
                    s[i][j] = m + 1;
                    s[i][j] = s[i][m];

                }
            }
        }
    }


    cout << "\nМатрица d после вычислений: \n";
    for (int i = 0; i < 6; i++)
    {
        for (int j = 0; j < 6; j++)
        {
            cout << d[i][j] << " ";
        }
        cout << "\n";
    }

    cout << "\nМатрица s после вычислений: \n";
    for (int i = 0; i < 6; i++)
    {
        for (int j = 0; j < 6; j++)
        {
            cout << s[i][j] << " ";
        }
        cout << "\n";
    }


}

